# name = "stroka" # именуем переменные контретно, не нужно использовать просто a или b
# name2 = 'stroka' # и двойные и одинарные кавычки используются одинаково

# name_input = input() # input отвечает за ввод, всегда работает только со строкой, принимает строку
# print(name_input) # print отвечает за вывод
# print(type(name_input)) # print(type) покажет класс введенного значения (строка, число и пр)

# name_input = int(input()) # добавили int, теперь класс измениться на заданный int, а при вооде строки будет ошибка
# print(name_input)
# print(type(name_input))

